[
  {
    "id": 1,
    "title": "Software Engineer",
    "description": "As a Software Engineer at our innovative tech company, you'll be part of a dynamic team responsible for designing, developing, and maintaining cutting-edge software applications. You'll work on a variety of projects, from developing scalable web applications to creating robust backend systems, using the latest technologies and methodologies. Collaboration with cross-functional teams will be key as you deliver high-quality, efficient, and scalable solutions that meet our business needs. Ideal candidates will have a passion for technology and a continuous drive to learn and improve their skills.",
    "location": "San Francisco, CA",
    "type": "Full-time",
    "salary": "100000-120000",
    "postedDate": "2024-01-01"
  },
  {
    "id": 2,
    "title": "Data Scientist",
    "description": "Our team is looking for a Data Scientist to analyze complex data sets and identify business and market trends that will drive our strategic decisions. In this role, you will apply your expertise in statistical analysis, machine learning, and data mining to model complex problems, discover insights, and identify new opportunities. You'll work closely with product and engineering teams to implement predictive models and improve our algorithms. The ideal candidate will have a strong foundation in mathematics, statistics, or computer science and experience with Python or R.",
    "location": "New York, NY",
    "type": "Full-time",
    "salary": "110000-130000",
    "postedDate": "2024-01-15"
  },
  {
    "id": 3,
    "title": "Product Manager",
    "description": "As a Product Manager for our fast-growing company, you'll lead the planning, execution, and launch of new products that meet our customers' needs. You will work closely with engineering, marketing, and sales teams to define product vision, roadmap, and growth opportunities. Your role involves gathering and prioritizing product and customer requirements, defining the product vision, and working closely with engineering to deliver winning products. The ideal candidate will have a blend of business and technical background, strong analytical skills, and the ability to thrive in a fast-paced environment.",
    "location": "Remote",
    "type": "Full-time",
    "salary": "90000-110000",
    "postedDate": "2024-01-10"
  },
  {
    "id": 4,
    "title": "Graphic Designer",
    "description": "We are seeking a creative Graphic Designer with experience in both digital and print media. You will be responsible for developing the overall layout and production design for advertisements, brochures, magazines, and corporate reports. This role requires a creative flair, up-to-date knowledge of industry software and a professional approach to time, costs, and deadlines. You'll collaborate with our marketing team to create visual content that communicates our brand message effectively. The ideal candidate should have a strong portfolio of design work and experience with tools such as Photoshop, Illustrator, and InDesign.",
    "location": "Los Angeles, CA",
    "type": "Contract",
    "salary": "70000-90000",
    "postedDate": "2024-01-20"
  }
]
